from yoyo import step

depends = {'20241104_01_JxoHp-create-table-animals_2'}

steps = [
    step("INSERT INTO animals_2 (id,name, description, path) VALUES "
         "(1,'Животные', 'Общее название всех животных', '1/'),"
         "(2,'Млекопитающие', 'Животные, которые кормят своих детенышей молоком', '1/2/'),"
         "(3,'Птицы', 'Пернатые животные', '1/3/'),"
         "(4,'Рептилии', 'Холоднокровные позвоночные животные', '1/4/'),"
         "(5,'Рыбы', 'Водные позвоночные животные', '1/5/'),"
         "(6,'Собаки', 'Домашние млекопитающие, известные как лучшие друзья человека', '1/2/6/'),"
         "(7,'Кошки', 'Домашние млекопитающие, известные своей независимостью', '1/2/7/'),"
         "(8,'Лошади', 'Крупные млекопитающие, используемые для верховой езды', '1/2/8/'),"
         "(9,'Орлы', 'Большие хищные птицы', '1/3/9/'),"
         "(10,'Воробьи', 'Маленькие птицы с коротким хвостом', '1/3/10/'),"
         "(11,'Змеи', 'Холоднокровные рептилии без конечностей', '1/4/11/'),"
         "(12,'Ящерицы', 'Рептилии с конечностями и длинным телом', '1/4/12/'),"
         "(13,'Окуни', 'Пресноводные рыбы с колючими плавниками', '1/5/13/'),"
         "(14,'Тунец', 'Большие морские рыбы', '1/5/14/'),"
         "(15,'Лабрадоры', 'Собаки среднего размера с висячими ушками', '1/2/6/15/'),"
         "(16,'Бенгалы', 'Одни из самых резвых кошек с гладкой шерстью', '1/2/7/16/'),"
         "(17,'Байкальские окуни', 'Это байкальские эндемики, встречаются в Бурятии', '1/5/13/17/'),"
         "(18,'Голубые тунцы', 'Второй по величине после обыкновенного тунца', '1/5/14/18/'),"
         "(19,'Европейские лабрадоры', 'В отличие от Американского его рост колеблется чуть меньше', '1/2/6/15/19/'),"
         "(20,'Селенгинские байкальские окуни', 'Заходят на нерест в реку Селенгу', '1/5/13/20/'),"
         "(21,'Речной окунь', 'Вид лучеперстных рыб из рода пресноводных окуней', '1/5/13/21/'),"
         "(22,'Желтоперый тунец', 'Встречается во всех тропических и умеренных широтах мировых океанов', '1/5/14/22/'),"
         "(23,'Северобайльский окунь', 'Встречается на севере Бурятии и сплавляется на реке Тыя', '1/5/13/17/23/'),"
         "(24,'Немецкая овчарка', 'Порода собак, изначально использовалась в качестве пастушьей собаки', '1/2/6/24/'),"
         "(25,'Британская вислоухая кошка', 'Часто ленивые коты с очень мягкой шерстью', '1/2/7/25/'),"
         "(26,'Американский лабладор', 'Чуть выше, чем Европейский лабрадор', '1/2/6/15/26/')"
    ),
    step(
        "DO $$ "
        "DECLARE "
        "    max_id INTEGER; "
        "BEGIN "
        "    SELECT COALESCE(MAX(id), 0) INTO max_id FROM animals_2; "
        "    EXECUTE 'ALTER SEQUENCE animals_2_id_seq RESTART WITH ' || (max_id + 1); "
        "END $$;"
    ),
]
