"""
insert_into_animals_2
"""

from yoyo import step

depends = {'20241104_01_JxoHp-create-table-animals_2'}

steps = [
    step("INSERT INTO animals_2 (name, description, path) VALUES "
         "('Животные', 'Общее название всех животных', '1/'),"
         "('Млекопитающие', 'Животные, которые кормят своих детенышей молоком', '1/2/'),"
         "('Птицы', 'Пернатые животные', '1/3/'),"
         "('Рептилии', 'Холоднокровные позвоночные животные', '1/4/'),"
         "('Рыбы', 'Водные позвоночные животные', '1/5/'),"
         "('Собаки', 'Домашние млекопитающие, известные как лучшие друзья человека', '1/2/6/'),"
         "('Кошки', 'Домашние млекопитающие, известные своей независимостью', '1/2/7/'),"
         "('Лошади', 'Крупные млекопитающие, используемые для верховой езды', '1/2/8/'),"
         "('Орлы', 'Большие хищные птицы', '1/3/9/'),"
         "('Воробьи', 'Маленькие птицы с коротким хвостом', '1/3/10/'),"
         "('Змеи', 'Холоднокровные рептилии без конечностей', '1/4/11/'),"
         "('Ящерицы', 'Рептилии с конечностями и длинным телом', '1/4/12/'),"
         "('Окуни', 'Пресноводные рыбы с колючими плавниками', '1/5/13/'),"
         "('Тунец', 'Большие морские рыбы', '1/5/14/'),"
         "('Лабрадоры', 'Собаки среднего размера с висячими ушками', '1/2/6/15/'),"
         "('Бенгалы', 'Одни из самых резвых кошек с гладкой шерстью', '1/2/7/16/'),"
         "('Байкальские окуни', 'Это байкальские эндемики, встречаются в Бурятии', '1/5/13/17/'),"
         "('Голубые тунцы', 'Второй по величине после обыкновенного тунца', '1/5/14/18/'),"
         "('Европейские лабрадоры', 'В отличие от Американского его рост колеблется чуть меньше', '1/2/6/15/19/'),"
         "('Селенгинские байкальские окуни', 'Заходят на нерест в реку Селенгу', '1/5/13/20/'),"
         "('Речной окунь', 'Вид лучеперстных рыб из рода пресноводных окуней', '1/5/13/21/'),"
         "('Желтоперый тунец', 'Встречается во всех тропических и умеренных широтах мировых океанов', '1/5/14/22/'),"
         "('Северобайльский окунь', 'Встречается на севере Бурятии и сплавляется на реке Тыя', '1/5/13/17/23/')"
         "('Немецкая овчарка', 'Порода собак, изначально использовалась в качестве пастушьей собаки', '1/2/6/24/')"
         "('Британская вислоухая кошка', 'Часто ленивые коты с очень мягкой шерстью', '1/2/7/25/')"
         "('Американский лабладор', 'Чуть выше, чем Европейский лабрадор', '1/2/6/15/26/')"
    ),
]
