"""
insert_into_animals
"""

from yoyo import step

depends = {'20241104_01_JxoHp-create-table-animals'}

steps = [
    step("INSERT INTO animals (id, parent_id, name, description) VALUES "
         "(1, NULL, 'Животные', 'Общее название всех животных'),"
         "(2, 1, 'Млекопитающие', 'Животные, которые кормят своих детенышей молоком'),"
         "(3, 1, 'Птицы', 'Пернатые животные'),"
         "(4, 1, 'Рептилии', 'Холоднокровные позвоночные животные'),"
         "(5, 1, 'Рыбы', 'Водные позвоночные животные'),"
         "(6, 2, 'Собаки', 'Домашние млекопитающие, известные как лучшие друзья человека'),"
         "(7, 2, 'Кошки', 'Домашние млекопитающие, известные своей независимостью'),"
         "(8, 2, 'Лошади', 'Крупные млекопитающие, используемые для верховой езды'),"
         "(9, 3, 'Орлы', 'Большие хищные птицы'),"
         "(10, 3, 'Воробьи', 'Маленькие птицы с коротким хвостом'),"
         "(11, 4, 'Змеи', 'Холоднокровные рептилии без конечностей'),"
         "(12, 4, 'Ящерицы', 'Рептилии с конечностями и длинным телом'),"
         "(13, 5, 'Окуни', 'Пресноводные рыбы с колючими плавниками'),"
         "(14, 5, 'Тунец', 'Большие морские рыбы'),"
         "(15, 6, 'Лабрадоры', 'Собаки среднего размера с висячими ушками'),"
         "(16, 7, 'Бенгалы', 'Одни из самых резвых кошек с гладкой шерстью'),"
         "(17, 13, 'Байкальские окуни', 'Это байкальские эндемики, встречаются в Бурятии'),"
         "(18, 14, 'Голубые тунцы', 'Второй по величине после обыкновенного тунца'),"
         "(19, 15, 'Европейские лабрадоры', 'В отличие от Американского его рост колеблется чуть меньше'),"
         "(20, 17, 'Селенгинские байкальские окуни', 'Заходят на нерест в реку Селенгу')",
          "(21, 13, 'Речной окунь', 'Вид лучеперстных рыб из рода пресноводных окуней')",
          "(22, 14, 'Желтоперый тунец', 'Встречается во всех тропических и умеренных широтах мировых океанов')",
          "(23, 17, 'Северобайльский окунь', 'Встречается на севере Бурятии и сплавляется на реке Тыя')",
          "(24, 6, 'Немецкая овчарка', 'Порода собак, изначально использовалась в качестве пастушьей собаки')",
          "(25, 7, 'Британская вислоухая кошка', 'Часто ленивые коты с очень мягкой шерстью')",
          "(26, 15, 'Американский лабрадор', 'Чуть выше, чем Европейский лабрадор')",
         ""),
]
