"""
insert-into-animals3
"""

from yoyo import step

depends = {'20241121_01_wDU4S-create-animals3'}

steps = [
    step("""
    INSERT INTO public.animals_3 (name, description, "left_g", "right_g") VALUES
        ('Животные', 'Общее название всех животных', 1, 52),
        ('Млекопитающие', 'Животные, которые кормят своих детенышей молоком', 8, 27),
        ('Собаки', 'Домашние млекопитающие, известные как лучшие друзья человека', 17, 26),
        ('Немецкая овчарка', 'Порода собак, изначально использовалась в качестве пастушьей собаки', 18, 19),
        ('Лабрадоры', 'Собаки среднего размера с висячими ушками', 20, 25),
        ('Европейские лабрадоры', 'В отличие от Американского его рост колеблется чуть меньше', 21, 22),
        ('Американский лабладор', 'Чуть выше, чем Европейский лабрадор', 23, 24),
        ('Кошки', 'Домашние млекопитающие, известные своей независимостью', 11, 16),
        ('Бенгалы', 'Одни из самых резвых кошек с гладкой шерстью', 12, 13),
        ('Британская вислоухая кошка', 'Часто ленивые коты с очень мягкой шерстью', 14, 15),
        ('Лошади', 'Крупные млекопитающие, используемые для верховой езды', 9, 10),
        ('Птицы', 'Пернатые животные', 2, 7),
        ('Орлы', 'Большие хищные птицы', 5, 6),
        ('Воробьи', 'Маленькие птицы с коротким хвостом', 3, 4),
        ('Рептилии', 'Холоднокровные позвоночные животные', 46, 51),
        ('Змеи', 'Холоднокровные рептилии без конечностей', 47, 48),
        ('Ящерицы', 'Рептилии с конечностями и длинным телом', 49, 50),
        ('Рыбы', 'Водные позвоночные животные', 28, 45),
        ('Окуни', 'Пресноводные рыбы с колючими плавниками', 35, 44),
        ('Речной окунь', 'Вид лучеперстных рыб из рода пресноводных окуней', 36, 37),
        ('Байкальские окуни', 'Это байкальские эндемики, встречаются в Бурятии', 38, 43),
        ('Селенгинские байкальские окуни', 'Заходят на нерест в реку Селенгу', 41, 42),
        ('Северобайльский окунь', 'Встречается на севере Бурятии и сплавляется на реке Тыя', 39, 40),
        ('Тунец', 'Большие морские рыбы', 29, 34),
        ('Голубые тунцы', 'Второй по величине после обыкновенного тунца', 30, 31),
        ('Желтоперые тунцы', 'Встречаются во всех тропических и умеренных широтах мировых океанов', 32, 33);
    """)
]
